app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'artikel' => $model->paginate(10), // data dibatasi 10 record per halaman
            'pager' => $model->pager
        ];